       01  patron-number	         pic XXX.
           01  patron-information.
               10  patron-name        pic X(23).
               10  street-address     pic X(20).
               10  city-state-zip     pic X(28).      

